class ZakrModel {
  String title;
  String content;
  bool isFavor;
  int counter;
  List<String>? timeOfRead;
  ZakrModel({
    required this.title,
    required this.content,
    this.isFavor = false,
    this.counter = 0,
    List<String>? timeOfRead,
  }) : timeOfRead = timeOfRead ?? [];

  Map<String, dynamic> toJson() {
    return {
      'title': title,
      'content': content,
      'isFavor': isFavor,
      'counter': counter,
      'timeOfRead': timeOfRead,
    };
  }

  factory ZakrModel.fromJson(Map<String, dynamic> json) {
    return ZakrModel(
      title: json['title'],
      content: json['content'],
      isFavor: json['isFavor'],
      counter: json['counter'],
      timeOfRead: json['timeOfRead']?.cast<String>(),
    );
  }
}

List<ZakrModel> usedListViewInsideDetails = [];
List<ZakrModel> zakrMainList = [
  ZakrModel(
      title: 'باب ما يقول إذا استيقظ من منامه',
      content:
          'كان رسول الله صلى الله عليه وسلم إذا أوى إلى فراشه قال : باسمك اللهم أحيا وأموت، وإذا استيقظ قال : الحمد لله الذي أحيانا بعدما أماتنا وإليه النشور\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول إذا لبس ثوبه',
      content:
          'كان النبي صلى الله عليه وسلم إذا لبس ثوبا سماه باسمه قميصا أو رداء أو عمامة يقول : اللهم إني أسألك من خيره وخير ما هو له، وأعوذ بك من شره وشر ما هو له\nصحيح رواه أبو داود والترمذي'),
  ZakrModel(
      title: 'باب ما يقول حال خروجه من بيته',
      content:
          'كان النبي صلى الله عليه وسلم إذا خرج من بيته قال : بسم الله توكلت على الله، اللهم إني أعوذ بك أن أضِلَّ أَوْ أُضَلَّ، أوْ أزِلَّ أَوْ أُزَلَّ، أَوْ أظْلِمَ أَوْ أُظْلَمَ، أوْ أجْهَلَ أَوْ يُجْهَلَ عليَّ\nصحيح رواه أبو داود والترمذي'),
  ZakrModel(
      title: 'باب ما يقول إذا دخل بيته',
      content:
          'قال النبي صلى الله عليه وسلم : إذا دخل الرجل بيته فذكر الله تعالى عند دخوله وعند طعامه قال الشيطان : لا مبيت لكم ولا عشاء، وإذا دخل فلم يذكر الله تعالى عند دخوله، قال الشيطان : أدركتم المبيت، وإذا لم يذكر الله تعالى عند طعامه قال : أدركتم المبيت والعشاء\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقول إذا استيقظ من الليل',
      content:
          'كان النبي صلى الله عليه وسلم إذا قام من الليل يتهجد قال : اللهم ربنا لك الحمد، أنت قيُّومُ السموات والأرض ومن فيهن، ولك الحمد، لك ملك السموات والأرض ومن فيهن، ولك الحمد أنت نور السموات والأرض ومن فيهن، ولك الحمد أنت الحق، ووعدك الحق، ولقاؤك حق، وقولك حق، والجنة حق، والنار حق، ومحمد حق، والساعة حق، اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت، وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت وما أخرت وما أسررت وما أعلنت، أنت المقدم وأنت المؤخر، لا إله إلا أنت\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول إذا أراد دخول الخلاء',
      content:
          'كان رسول الله صلى الله عليه وسلم يقول عند دخول الخلاء : اللهم إني أعوذ بك من الخبث والخبائث\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول إذا خرج من الخلاء',
      content:
          'كان رسول الله صلى الله عليه وسلم  يقول إذا خرج من الخلاء : غفرانك\nصحيح رواه البخاري في الادب المفرد وأبو داود والترمزي'),
  ZakrModel(
      title: 'باب ما يقول بعد وضوئه',
      content:
          'قال رسول الله صلى الله عليه وسلم : من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدا عبده ورسوله، فتحت له أبواب الجنة الثمانية يدخل من أيها شاء\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقول عند دخول المسجد والخروج منه',
      content:
          'قال رسول الله صلى الله عليه وسلم : إذا دخل أحدكم المسجد فليسلم على النبي صلى الله عليه وسلم، ثم ليقل : اللهم افتح لي أبواب رحمتك، وإذا خرج فليقل : اللهم إني أسألك من فضلك\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقول من سمع المؤذن',
      content:
          'قال رسول الله صلى الله عليه وسلم : إذا سمعتم المؤذن فقولوا مثل ما يقول، ثم صلوا علي، فإنه من صلى علي صلاة صلى الله عليه بها عشرا، ثم سلوا الله لي الوسيلة، فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو، فمن سأل لي الوسيلة حلت له الشفاعة\nرواه مسلم\nوعن جابر بن عبد الله رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال : من قال حين يسمع النداء : اللهم رب هذه الدعوة التامة والصلاة القائمة، آت محمدا الوسيلة والفضيلة، وابعثه مقاما محمودا الذي وعدته، حلت له شفاعتي يوم القيامة\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول بعد تكبيرة الإحرام (دعاء الاستفتاح)',
      content:
          'عن أبي هريرة رضي الله عنه قال : كان رسول الله صلى الله عليه وسلم إذا كبر في الصلاة سكت هنية قبل أن يقرأ، فقلت : يا رسول الله بأبي أنت وأمي أرأيت سكوتك بين التكبير والقراءة ما تقول؟ قال أقول : اللهم باعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب، اللهم نقني من خطاياي كما ينقى الثوب الأبيض من الدنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد\nمتفق عليه'),
  ZakrModel(
      title: 'باب أذكار الركوع',
      content:
          'كان رسول الله صلى الله عليه وسلم يقول في ركوعه وسجوده : سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول إذا رفع رأسه من الركوع',
      content:
          'عن رفاعة بن رافع الزرقي رضي الله عنه قال : كنا يوما نصلي وراء النبي صلى الله عليه وسلم، فلما رفع رأسه من الرُّكوعِ قال : سمع الله لمن حمده، فقال رجل وراءه : ربنا ولك الحمد حمدا كثيرا طيبا مباركا فيه، فلما انصرف قال : من المتكلم؟  قال : أنا، قال : رأيت بضعة وثلاثين ملكا يبتدرونها أيهم يكتبها أول\nرواه البخاري'),
  ZakrModel(
      title: 'باب أذكار السجود',
      content:
          'عن عائشة رضي الله عنها قالت فقدت رسول الله صلى الله عليه وسلم ليلة من الفراش فالتمسته فوقعت يدي على بطن قدميه وهو في المسجد وهما منصوبتان وهو يقول اللهم أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقول بين السجدتين',
      content:
          'كان النبي صلى الله عليه وسلم يقول بين السجدتين : اللهم اغفر لي وارحمني وعافني واهدني وارزقني\nصحيح رواه أبو داود'),
  ZakrModel(
      title: 'باب القنوت في الصبح',
      content:
          'عن الحسن بن علي رضي الله عنهما قال : علمني رسول الله صلى الله عليه وسلم كلمات أقولهن في الوتر : اللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت، وقني شر ما قضيت، فإنك تقضي ولا يقضى عليك، إنه لا يذل من واليت، تباركت ربنا وتعاليت\nصحيح رواه أبو داود والترمذي'),
  ZakrModel(
      title: 'باب التشهد في الصلاة',
      content:
          'التحيات لله، والصلوات والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أن لا إله إلا الله، وأشهد أن محمدا عبده ورسوله\nمتفق عليه\nوعن كعب بن عُجرة أن النبي صلى الله عليه وسلم خرج عليهم فقالوا : يا رسول الله قد علمتنا كيف نسلم عليك فكيف نصلي عليك؟ قال فقولوا : اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد، اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد\nمتفق عليه'),
  ZakrModel(
      title: 'باب الدعاء بعد التشهد الأخير',
      content:
          'قال رسول الله صلى الله عليه وسلم : إذا فرغ أحدكم من التشهد الأخير فليتعوذ بالله من أربع : من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شر المسيح الدجال\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول الرجل إذا كلمه إنسان وهو في الصلاة',
      content:
          'عن سهل بن سعد الساعدي رضي الله عنه أن رسول الله صلى الله عليه وسلم قال : من نابه شئ في صلاته، فليقل : سبحان الله\nمتفق عليه\nوقال رسول الله صلى الله عليه وسلم من نابه شيء في صلاته فليسبح، فإنما التصفيق للنساء\nمتفق عليه'),
  ZakrModel(
      title: 'باب الأذكار بعد الصلاة',
      content:
          'عن المغيرة بن شعبة رضي الله عنه، أن رسول الله صلى الله عليه وسلم كان إذا فرغ من الصلاة وسلم قال : لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يُقال عند الصباح وعند المساء',
      content:
          'عن شداد بن أوس رضي الله عنه، عن النبي صلى الله عليه وسلم قال سيد الاستغفار : اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت، إذا قال ذلك حين يمسي فمات من ليلته دخل الجنة، أو كان من أهل الجنة، وإذا قال ذلك حين يصبح فمات من يومه ... مثله\nرواه البخاري\nوقال رسول الله صلى الله عليه وسلم : من قال حين يصبح وحين يمسي : سبحان الله وبحمده مائة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه\nرواه مسلم\nوعن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم أنه كان يقول إذا أصبح : اللهم بك أصبحنا وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور وإذا أمسى قال : اللهم بك أمسينا، وبك نحيا، وبك نموت وإليك النشور\nصحيح رواه البخاري في الادب المفرد\nوعن عبد الله بن مسعود رضي الله عنه قال : كان النبي صلى الله عليه وسلم إذا أمسى قال : أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شئ قدير، رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل وسوء الكبر،رب أعوذ بك من عذاب في النار وعذاب في القبر  وإذا أصبح قال ذلك أيضا : أصبحنا وأصبح الملك لله...\nرواه مسلم\nوعن أبي هريرة رضي الله عنه قال : جاء رجل إلى النبي صلى الله عليه وسلم فقال : يا رسول الله ما لقيت من عقرب لدغتني البارحة؟ قال : أما لو قلت حين أمسيت : أعوذ بكلمات الله التامات من شر ما خلق لم تضرك\nرواه مسلم\nوعن أبي هريرة رضي الله عنه أن أبا بكر الصديق رضي الله عنه قال : يارسول الله مرني بكلمات أقولهن إذا أصبحت وإذا أمسيت، قال : قل اللهم فاطر السموات والأرض، عالم الغيب والشهادة رب كل شئ ومليكه، أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي وشر الشيطان وشركه، قال : قلها إذا أصبحت وإذا أمسيت وإذا أخذت مضجعك\nصحيح رواه البخاري في الادب المفرد\nوعن عثمان بن عفان رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : ما من عبد يقول في صباح كل يوم ومساء كل ليلة : بسم الله الذي لا يضر مع اسمه شئ في الأرض ولا في السماء وهو السميع العليم، ثلاث مرات لم يضره شئ\nصحيح رواه البخاري في الادب المفرد\nوعن ابن عمر رضي الله عنهما قال : لم يكن النبي صلى الله عليه وسلم يدع هؤلاء الدعوات حين يمسي وحين يصبح : اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهم استر عوراتي وآمن روعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أغتال من تحتي\nصحيح رواه البخاري في الادب المفرد\nوعن أبي عياش رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال : من قال إذا أصبح : لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، كان له عدل رقبة من ولد إسماعيل صلى الله عليه وسلم، وكتب له عشر حسنات، وحط عنه عشر سيئات، ورفع له عشر درجات، وكان في حرز من الشيطان حتى يمسي، وإن قالها إذا أمسى كان له مثل ذلك حتى يصبح\nصحيح رواه أبو داود\nوعن عبد الرحمن بن أبي بكرة، أنه قال لأبيه : يا أبت إني أسمعك تدعو كل غداة : اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت، تعيدها حين تصبح ثلاثا، وثلاثا حين تمسي، فقال : إني سمعت رسول الله صلى الله عليه وسلم يدعو بهن، فأنا أحب أن أستن بسنته\nحسن رواه البخاري في الادب المفرد\nوعن عبد الله بن أبزى رضي الله عنه قال : كان رسول الله صلى الله عليه وسلم إذا أصبح قال : أصبحنا على فطرة الإسلام، وكلمة الإخلاص، ودين نبيا محمد صلى الله عليه وسلم، وملة إبراهيم صلى الله عليه وسلم حنيفا مسلما وما أنا من المشركين\nصحيح رواه النسائي\nوقال رسول الله صلى الله عليه وسلم لفاطمة رضي الله عنها : ما يمنعك أن تسمعي ما أوصيك به؟ تقولين إذا أصبحت وإذا أمسيت : يا حي يا قيوم بك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طرفة عين\nحسن رواه النسائي\nوعن أم سلمة رضي الله عنها، أن رسول الله صلى الله عليه وسلم كان إذا أصبح قال : اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا\nصحيح رواه النسائي'),
  ZakrModel(
      title: 'باب ما يقول بعد صلاة الوتر',
      content:
          'عن أُبي بن كعب رضي الله عنه قال : كان رسول الله صلى الله عليه وسلم إذا سلم في الوتر قال : سبحان الملك القدوس " ثلاث مرات\nصحيح رواه أبو داود والنسائي'),
  ZakrModel(
      title: 'باب ما يقول إذا أراد النوم واضطجع على فراشه',
      content:
          'عن علي رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال له ولفاطمة رضي الله عنهما: " إذا أويتما إلى فراشكما، أو إذا أخذتما مضاجعكما، فكبرا ثلاثا وثلاثين، وسبحا ثلاثا وثلاثين، واحمدا ثلاثا وثلاثين\nمتفق عليه\nو عن أبي هريرة رضي الله عنه، قال : قال رسول الله صلى الله عليه وسلم : إذا أوى أحدكم إلى فراشه، فلينفض فراشه بداخلة إزاره، فإنه لا يدري ما خلفه عليه، ثم يقول : باسمك ربي وضعت جنبي وبك أرفعه، إن أمسكت نفسي فارحمها، وإن أرسلتها فاحفظها بما تحفظ به عبادك الصالحين\nمتفق عليه\nوعن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما وقرأ فيهما : قل هو الله أحد، وقل أعوذ برب الفلق، وقل أعوذ برب الناس، ثم مسح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه، وما أقبل من جسده، يفعل ذلك ثلاث مرات\nمتفق عليه\nو عن البراء بن عازب رضي الله عنهما، قال : قال رسول الله صلى الله عليه وسلم : إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن وقل : اللهم أسلمت نفسي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت، ونبيك الذي أرسلت فإن مت مت على الفطرة، واجعلهن آخر ما تقول\nمتفق عليه\nو عن أبي هريرة رضي الله عنه، قال : وكلني رسول الله صلى الله عليه وسلم بحفظ زكاة رمضان، فأتاني آت، فجعل يحثو من الطعام وذكر الحديث، وقال في آخره : إذا أويت إلى فراشك فاقرأ آية الكرسي، فإنه لن يزال معك من الله تعالى حافظ، ولا يقربك شيطان حتى تصبح، فقال النبي صلى الله عليه وسلم : صدقك وهو كذوب، ذاك شيطان\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول إذا استيقظ في الليل وأراد النوم بعده',
      content:
          'قال رسول الله صلى الله عليه وسلم : من تعار من الليل فقال : لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شئ قدير، والحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله، ثم قال : اللهم اغفر لي أو دعا، استُجيب له، فإن توضأ قبلت صلاته\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول إذا كان يفزع في منامه',
      content:
          'كان رسول الله صلى الله عليه وسلم  يعلمهم من الفزع كلمات : أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون\nحسن رواه أبو داود والترمذي'),
  ZakrModel(
      title: 'باب ما يقول إذا رأى في منامه ما يكره',
      content:
          'قال رسول الله صلى الله عليه وسلم : الرؤيا الصالحة من الله، والحلم من الشيطان، فمن رأى شيئا يكرهه فلينفث عن يساره ثلاثا، وليتعوذ من الشيطان، فإنها لا تضره\nمتفق عليه'),
  ZakrModel(
      title:
          'باب أمر من ذُكر عنده النبي صلى الله عليه وسلم بالصلاة عليه والتسليم',
      content:
          'قال رسول الله صلى الله عليه وسلم : رغم أنف رجل ذكرت عنده فلم يصل علي\nصحيح رواه الترمذي وأحمد\nو عن علي رضي الله عنه قال : قال رسول الله صلى الله عليه وسلم : البخيل من ذُكرت عنده، فلم يصل علي\nصحيح رواه الترمذي'),
  ZakrModel(
      title: 'باب دعاء الاستخارة',
      content:
          'عن جابر بن عبد الله رضي الله عنهما قال : كان رسول الله صلى الله عليه وسلم يعلمنا الاستخارة في الأمور كلها، كالسورة من القرآن، يقول : إذا هم أحدكم بالأمر فليركع ركعتين من غير الفريضة، ثم ليقل : اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك العظيم، فإنك تقدر ولا أقدر، وتعلم ولا أعلم، وأنت علام الغيوب، اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري - أو قال: عاجل أمري وآجله - فاقدره لي ويسره لي، ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري - أو قال: عاجل أمري وآجله - فاصرفه عني واصرفني عنه واقدر لي الخير حيث كان ثم رضني به، قال : ويسمي حاجته\nرواه البخاري'),
  ZakrModel(
      title: 'باب دعاء الكرب والدعاء عند الأمور المهمة',
      content:
          'عن ابن عباس رضي الله عنهما، أن رسول الله صلى الله عليه وسلم كان يقول عند الكرب : لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب الأرض ورب العرش الكريم\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول إذا راعه شئ أو فزع',
      content:
          'عن ثوبان رضي الله عنه، أن النبي صلى الله عليه وسلم كان إذا راعه شئ قال : هو الله، الله ربي لا شريك له\nصحيح رواه النسائي'),
  ZakrModel(
      title: 'باب ما يقول إذا أصابه هم أو حزن',
      content:
          'قال رسول الله صلى الله عليه وسلم : من أصابه هم أو حزن فليدع بهذه الكلمات، يقول : اللهم إني عبدك، ابن عبدك، ابن أمتك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك، سميت به نفسك، أو أنزلته في كتابك، أو علمته أحدا من خلقك، أو استأثرت به في علم الغيب عندك أن تجعل القرآن نور صدري، وربيع قلبي، وجلاء حزني، وذهاب همي، فقال رجل من القوم : يا رسول الله إن المغبون لمن غبن في هؤلاء الكلمات، فقال : أجل فقولوهن وعلموهن، فإنه من قالهن الْتِماسَ ما فيهن أذهب الله تعالى حزنه، وأطال فرحه\nحسن رواه ابن السني'),
  ZakrModel(
      title: 'باب ما يقول إذا خاف قوما',
      content:
          'عن أبي موسى الأشعري رضي الله عنه، أن النبي صلى الله عليه وسلم كان إذا خاف قوما قال : اللهم إنا نجعلك في نحورهم، ونعوذ بك من شرورهم\nصحيح رواه أبو داود والنسائي'),
  ZakrModel(
      title: 'باب ما يقول إذا غلبه أمر',
      content:
          'قال رسول الله صلى الله عليه وسلم : المؤمن القوي خير وأحب إلى الله تعالى من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجزن، وإن أصابك شئ فلا تقل : لو أني فعلت كان كذا وكذا، ولكن قل : قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقول إذا استصعب عليه أمر',
      content:
          'عن أنس رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال : اللهم لا سهل إلا ما جعلته سهلا، وأنت تجعل الحزن إذا شئت سهلا\nصحيح رواه ابن السني'),
  ZakrModel(
      title: 'باب ما يقول إذا كان عليه دين عجز عنه',
      content:
          'عن علي رضي الله عنه، أن مكاتبا جاءه فقال : إني عجزت عن كتابتي فأعني، قال : ألا أعلمك كلمات علمنيهن رسول الله صلى الله عليه وسلم، لو كان عليك مثل جبل دينا أداه عنك؟ قال قل : اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك\nحسن رواه الترمذي'),
  ZakrModel(
      title: 'باب ما يقول من بلي بالوسوسة',
      content:
          'قال رسول الله صلى الله عليه وسلم : يأتي الشيطان أحدكم فيقول : من خلق كذا؟ من خلق كذا؟ حتى يقول : من خلق ربك؟ فإذا بلغ ذلك فليستعذ بالله ولينته\nمتفق عليه\nو عن عثمان بن أبي العاص رضي الله عنه، قال : قلت يا رسول الله إن الشيطان قد حال بيني وبين صلاتي وقراءتي يلبسها علي، فقال رسول الله صلى الله عليه وسلم : ذلك شيطان يقال له : خنزب، فإذا أحسسته فتعوذ بالله منه واتفل عن يسارك ثلاثا ففعلت ذلك فأذهبه الله عني\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يُعَوذ به الصبيان وغيرهم',
      content:
          'عن ابن عباس رضي الله عنهما، قال : كان رسول الله صلى الله عليه وسلم يُعَوذ الحسن والحسين : أعيذكما بكلمات الله التامة، من كل شيطان وهامة، ومن كل عين لامة، ويقول : إن أباكما كان يعوذ بها إسماعيل وإسحاق صلى الله عليهم أجمعين وسلم\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول المريض ويُقال عنده ويُقرأ عليه',
      content:
          'عن عائشة رضي الله عنها، أن النبي صلى الله عليه وسلم كان يعوذ بعض أهله، يمسح بيده اليمنى ويقول : اللهم رب الناس أذهب البأس، اشف أنت الشافي، لا شفاء إلا شفاؤك شفاء لا يغادر سقما\nمتفق عليه\nوعن عثمان بن أبي العاص رضي الله عنه، أنه شكا إلى رسول الله صلى الله عليه وسلم وجعا يجده في جسده، فقال له رسول الله صلى الله عليه وسلم : ضع يدك على الذي تألم من جسدك، وقل : بسم الله ثلاثا، وقل سبع مرات : أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر\nرواه مسلم'),
  ZakrModel(
      title:
          'باب كراهية تمني الموت لضر نزل بالإنسان وجوازه إذا خاف فتنة في دينه',
      content:
          'قال النبي صلى الله عليه وسلم : لا يتمنين أحدكم الموت من ضر أصابه، فإن كان لا بد فاعلا فليقل : اللهم أحيني ما كانت الحياة خيرا لي، وتوفني إذا كانت الوفاة خيرا لي\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول عند الموت',
      content:
          'قال رسول الله صلى الله عليه وسلم : من كان آخر كلامه لا إله إلا الله دخل الجنة \nصحيح رواه أبو داود'),
  ZakrModel(
      title: 'باب ما يقول بعد تغميض الميت',
      content:
          'عن أم سلمة رضي الله عنها قالت : دخل رسول الله صلى الله عليه وآله وسلم على أبي سلمة، وقد شق بصره، فأغمضه ثم قال : إن الروح إذا قبض تبعه البصر، فضج ناس من أهله، فقال : لا تدعوا على أنفسكم إلا بخير، فإن الملائكة يؤمنون على ما تقولون، ثم قال : اللهم اغفر لأبي سلمة، وارفع درجته في المهديين، واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين، وافسح في قبره ونور له فيه\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقول من مات له ميت',
      content:
          'عن أم سلمة رضي الله عنها قالت : سمعت رسول الله صلى الله عليه وسلم يقول : ما من عبد تصيبه مصيبة فيقول : إنا لله وإنا إليه راجعون، اللهم أجرني في مصيبتي، وأخلف لي خيرا منها، إلا أجره الله تعالى في مصيبته وأخلف له خيرا منها، قالت : فلما توفي أبو سلمة، قلت كما أمرني رسول الله صلى الله عليه وسلم، فأخلف الله تعالى لي خيرا منه : رسول الله صلى الله عليه وسلم\nرواه مسلم\nوقال رسول الله صلى الله عليه وسلم : إذا مات ولد العبد قال الله تعالى لملائكته : قبضتم ولد عبدي؟ فيقولون نعم، فيقول : قبضتم ثمرة فؤاده؟ فيقولون: نعم، فيقول : فماذا قال عبدي؟ فيقولون: حمدك واسترجع، فيقول الله تعالى : ابنوا لعبدي بيتا في الجنة وسموه بيت الحمد\nحسن رواه الترمذي'),
  ZakrModel(
      title: 'باب الدعاء في الصلاة على الميت',
      content:
          'عن عوف بن مالك رضي الله عنه قال : صلى رسول الله صلى الله عليه وسلم على جنازة فحفظت من دعائه وهو يقول : اللهم اغفر له، وارحمه، وعافه، واعف عنه، وأكرم نزله، ووسع مدخله، واغسله بالماء والثلج والبرد، ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس، وأبدله دارا خيرا من داره، وأهلا خيرا من أهله، وزوجا خيرا من زوجه، وأدخله الجنة، وأعذه من عذاب القبر أو من عذاب النار حتى تمنيت أن أكون أنا ذلك الميت\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقوله من يدخل الميت قبره',
      content:
          'عن ابن عمر رضي الله عنهما، أن النبي صلى الله عليه وسلم كان إذا وضع الميت في القبر قال : بسم الله، وعلى سنة رسول الله صلى الله عليه وسلم\nصحيح رواه أبو داود والترمذي'),
  ZakrModel(
      title: 'باب ما يقول بعد الدفن',
      content:
          'عن عثمان رضي الله عنه، قال : كان النبي صلى الله عليه وسلم إذا فرغ من دفن الميت، وقف عليه فقال : استغفروا لأخيكم، وسألوا الله له التثبيت فإنه الآن يسأل\nصحيح رواه أبو داود'),
  ZakrModel(
      title: 'باب ما يقول زائر القبور',
      content:
          'عن عائشة رضي الله عنها قالت : كيف أقول يا رسول الله؟ - تعني في زيارة القبور - قال قولي : السلام على أهل الديار من المؤمنين والمسلمين، ويرحم الله المستقدمين منكم ومنا المستأخرين، وإنا إن شاء الله بكم لاحقون\nرواه مسلم'),
  ZakrModel(
      title: 'باب الأذكار في العشر الأول من ذي الحجة',
      content:
          'قال رسول الله صلى الله عليه وسلم : خير الدعاء دعاء يوم عرفة، وخير ما قلت أنا والنبيون من قبلي : لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شئ قدير\nحسن رواه الترمذي'),
  ZakrModel(
      title: 'باب الأذكار المشروعة في الكسوف',
      content:
          'قال رسول الله صلى الله عليه وسلم : إن الشمس والقمر آيتان من آيات الله لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فادعوا الله تعالى وكبروا وتصدقوا\nمتفق عليه'),
  ZakrModel(
      title: 'باب الأذكار في الاستسقاء',
      content:
          'عن جابر بن عبد الله رضي الله عنهما قال : أتت النبي صلى الله عليه وسلم بَوَاكٍ فقال : اللَّهُمَّ اسْقِنا غَيْثاً مُغِيثاً مَرِيّاً سَرِيعاً نافعاً غَيْرَ ضَارّ، عاجِلاً غَيْرَ آجِلٍ، فأطبقت عليهم السماء\nصحيح رواه أبو داود'),
  ZakrModel(
      title: 'باب ما يقول إذا هاجت الريح',
      content:
          'عن عائشة رضي الله عنها، قالت : كان النبي صلى الله عليه وسلم إذا عصفت الريح قال : اللهم إني أسألك خيرها وخير ما فيها، وخير ما أرسلت به، وأعوذ بك من شرها وشر ما فيها وشر ما أرسلت به\nرواه مسلم'),
  ZakrModel(
      title: 'باب ما يقول إذا نزل المطر',
      content:
          'عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم كان إذا رأى المطر قال : اللهم صيبا نافعا\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول إذا رأى الهلال',
      content:
          'عن طلحة بن عبيد الله رضي الله عنه، أن النبي صلى الله عليه وسلم كان إذا رأى الهلال قال : اللهم أهله علينا باليمن والإيمان والسلامة والإسلام ربي وربك الله\nصحيح رواه الترمذي'),
  ZakrModel(
      title: 'باب ما يقول عند الإفطار',
      content:
          'عن ابن عمر رضي الله عنهما، قال : كان النبي صلى الله عليه وسلم إذا أفطر قال : ذهب الظمأ، وابتلت العروق، وثبت الأجر إن شاء الله تعالى\nحسن رواه أبو داود'),
  ZakrModel(
      title: 'باب ما يقول إذا أفطر عند قوم',
      content:
          'عن أنس رضي الله عنه، أن النبي صلى الله عليه وسلم جاء إلى سعد بن عبادة، فجاء بخبز وزيت، فأكل، ثم قال النبي صلى الله عليه وسلم : أفطر عندكم الصائمون، وأكل طعامكم الأبرار وصلت عليكم الملائكة\nصحيح رواه أبو داود'),
  ZakrModel(
      title: 'باب ما يَدعُو به إذا صادف ليلة القدر',
      content:
          'عن عائشة رضي الله عنها قالت : قلت يا رسول الله إن علمت ليلة القدر ما أقول فيها؟ قال قولي : اللهم إنك عفو تحب العفو فاعف عني\nصحيح رواه الترمذي'),
  ZakrModel(
      title: 'باب أذكار الخروج للسفر',
      content:
          'قال رسول الله صلى الله عليه وسلم من أراد أن يسافر فليقل لمن يخلف : أستودعكم الله الذي لا تضيع ودائعه\nصحيح رواه النسائي'),
  ZakrModel(
      title: 'باب ما يقول إذا ركب دابته',
      content:
          'عن عبد الله بن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا استوى على بعيره خارجا إلى سفر كبر ثلاثا، ثم قال : سبحان الذي سخر لنا هذا وما كنا له مقرنين، وإنا إلى ربنا لمنقلبون اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ما ترضى، اللهم هون علينا سفرنا هذا، واطو عنا بعده، اللهم أنت الصاحب في السفر والخليفة في الأهل، اللهم إني أعوذ بك من وَعْثاءِ السفر، وكآبة المنظر، وسوء المنقلب في المال والأهل وإذا رجع قالهن، وزاد فيهن : آيبون تائبون عابدون لربنا حامدون\nرواه مسلم'),
  ZakrModel(
      title: 'باب تكبير المسافر إذا صعد وتسبيحه إذا هَبَطَ',
      content:
          'عن جابر رضي الله عنه قال : كنا إذا صعدنا كبرنا، وإذا نزلنا سبحنا\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول إذا رأى قرية يريد دخولها',
      content:
          'عن صهيب رضي الله عنه أن النبي صلى الله عليه وسلم لم ير قرية يريد دخولها إلا قال حين يراها : اللهم رب السموات السبع وما أظللن، والأرضين السبع وما أقللن، ورب الشياطين وما أضللن، ورب الرياح وما ذرين، أسألك خير هذه القرية وخير أهلها وخير ما فيها، ونعوذ بك من شرها وشر أهلها وشر ما فيها\nصحيح رواه النسائي'),
  ZakrModel(
      title: 'باب ما يقول إذا نزل منزلا',
      content:
          'قال رسول الله صلى الله عليه وسلم من نزل منزلا ثم قال : أعوذ بكلمات الله التامات من شر ما خلق، لم يضره شئ حتى يرتحل من منزله ذلك\nرواه مسلم'),
  ZakrModel(
      title: 'باب التسمية عند الأكل والشرب',
      content:
          'عن عمر بن أبي سلمة رضي الله عنهما قال : قال لي رسول الله صلى الله عليه وسلم : سم الله، وكل بيمينك وكل مما يليك\nمتفق عليه\nوقال رسول الله صلى الله عليه وسلم : إذا أكل أحدكم فليذكر اسم الله تعالى في أوله، فإن نسي أن يذكر اسم الله تعالى في أوله فليقل : بسم الله أوله وآخره\nصحيح رواه أبو داود والترمذي'),
  ZakrModel(
      title: 'باب ما يقول إذا فرغ من الطعام',
      content:
          'عن أبي أمامة رضي الله عنه أن النبي صلى الله عليه وسلم كان إذا رُفع مائدته قال : الحمد لله كثيرا طيبا مباركا فيه غير مَكْفيٍّ ولا مُوَدَّعٍ ولا مُسْتَغْنىً عنه ربنا\nرواه البخاري'),
  ZakrModel(
      title: 'باب تشميت العاطس',
      content:
          'قال رسول الله صلى الله عليه وسلم : إذا عطس أحدكم فليقل : الحمد لله، وليقل له أخوه أو صاحبه : يرحمك الله، فإذا قال له : يرحمك الله، فليقل : يهديكم الله ويصلح بالكم\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول عند عقد النكاح',
      content:
          'عن عبد الله بن مسعود رضي الله عنه قال : علمنا رسول الله صلى الله عليه وسلم خطبة الحاجة : الحمد لله نستعينه ونستغفره ونعوذ به من شرور أنفسنا، من يهد الله فلا مضل له، ومن يضلل فلا هادي له، وأشهد أن لا إله إلا الله وحده لا شريك له، وأشهد أن محمدا عبده ورسوله، (يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها، وبث منهما رجالا كثيرا ونساء، واتقوا الله الذي تساءلون به والأرحام، إن الله كان عليكم رقيبا) (يا أيها الذين آمنوا اتقوا الله حق تقاته ولا تموتن إلا وأنتم مسلمون) (يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا يصلح لكم أعمالكم، ويغفر لكم ذنوبكم، ومن يطع الله ورسوله فقد فاز فوزا عظيما)\nصحيح رواه أبو داود'),
  ZakrModel(
      title: 'باب ما يقال للزوج بعد عقد النكاح',
      content:
          'عن أبي هريرة رضي الله عنه، أن النبي صلى الله عليه وسلم كان إذا رفأ الإنسان،أي إذا تزوج قال : بارك الله لك، وبارك عليك، وجمع بينكما في خير\nصحيح رواه أبو داود والترمذي'),
  ZakrModel(
      title: 'باب ما يقول عند الجماع',
      content:
          'قال رسول الله صلي الله عليه وسلم لو أن أحدكم إذا أتى أهله قال : بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا فقُضي بينهما ولد لم يضره\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول إذا سمع صياح الديك ونهيق الحمار ونباح الكلب',
      content:
          'قال رسول الله صلي الله عليه وسلم إذا سمعتم نُهَاقَ الحمير فتعوذوا بالله من الشيطان، فإنها رأت شيطانا، وإذا سمعتم صياح الديكة فاسألوا الله من فضله فإنها رأت ملكا\nمتفق عليه\nوقال رسول الله صلي الله عليه وسلم إذا سمعتم نباح الكلاب ونهيق الحمير بالليل فتعوذوا بالله، فإنهن يَرَيْنَ ما لا ترون\nصحيح رواه البخاري في الادب المفرد'),
  ZakrModel(
      title: 'باب ما يقول عند القيام من المجلس',
      content:
          'قال رسول الله صلى الله عليه وسلم : من جلس في مجلس فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك : سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك، إلا غفر له ما كان في مجلسه ذلك\nصحيح رواه الترمذي'),
  ZakrModel(
      title: 'باب ما يقول إذا غضب',
      content:
          'عن سليمان بن صرد الصحابي رضي الله عنه قال : كنت جالسا مع النبي صلى الله عليه وسلم ورجلان يستبان، وأحدهما قد احمر وجهه، وانتفخت أوداجه، فقال رسول الله صلى الله عليه وسلم : إني لأعلم كلمة لو قالها لذهب عنه ما يجد، لو قال : أعوذ بالله من الشيطان الرجيم، ذهب منه ما يجد، فقالوا له : أن النبي صلى الله عليه وسلم قال : تعوذ بالله من الشيطان الرجيم، فقال : وهل بي من جنون؟\nمتفق عليه'),
  ZakrModel(
      title: 'باب ما يقول إذا رأى مبتلى بمرض أو غيره',
      content:
          'قال رسول الله صلى الله عليه وسلم من رأى مبتلى فقال : الحمد لله الذي عافاني مما ابتلاك به وفضلني على كثير ممن خلق تفضيلا، لم يصبه ذلك البلاء\nصحيح رواه الترمذي'),
  ZakrModel(
      title: 'باب ما يقول إذا عثرت دابته',
      content:
          'عن أبي المليح التابعي المشهور عن رجل قال : كنت رديف النبي صلى الله عليه وسلم فعثرت دابته فقلت : تعس الشيطان، فقال : لا تقل تعس الشيطان، فإنك إذا قلت ذلك تعاظم حتى يكون مثل البيت ويقول : بقوتي، ولكن قل : بسم الله، فإنك إذا قلت ذلك تصاغر حتى يكون مثل الذباب\nصحيح رواه أبو داود'),
  ZakrModel(
      title: 'باب دعاء الإنسان لمن صنع معروفا إليه',
      content:
          'قال رسول الله صلى الله عليه وسلم من صُنِعَ إليه معروف فقال لفاعله : جزاك الله خيرا، فقد أبلغ في الثناء\nصحيح رواه الترمذي'),
  ZakrModel(
      title: 'باب ما يقول إذا خاف من إصابه العين',
      content:
          'قال رسول الله صلى الله عليه وسلم العين حق ولو كان شئ سابق القدر سبقته العين، وإذا اسْتُغْسلْتم فاغْسِلُوا\nرواه مسلم\nوعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان يُعوِّذ الحسن والحسين : أُعِيذُكُما بكلمات الله التامة من كل شيطان وهامة ومن كل عين لامة، ويقول : إن أباكما كان يعوذ بهما إسماعيل وإسحاق\nرواه البخاري'),
  ZakrModel(
      title: 'باب ما يقول إذا رأى ما يحب وما يكره',
      content:
          'عن عائشة رضي الله عنها قالت : كان رسول الله صلى الله عليه وسلم إذا رأى ما يحب قال : الحمد لله الذي بنعمته تتم الصالحات، وإذا رأي ما يكره قال : الحمد لله على كل حال\nحسن رواه ابن ماجه'),
  ZakrModel(
      title: 'باب ما يقول ويفعله من تكلم بكلام قبيح',
      content:
          'قال رسول الله صلى الله عليه وسلم : من حلف فقال في حلفه : واللات والعزى، فليقل : لا إله إلا الله، ومن قال لصاحبه : تعال أقامرك، فليتصدق\nمتفق عليه'),
  ZakrModel(
      title: 'باب دعاء الإنسان وتوسله بصالح عمله إلى الله تعالى',
      content:
          'عن ابن عمر رضي الله عنهما، أن رسول الله صلي الله عليه وسلم قال : بينما ثلاثة نفر ممن كان قبلكم يمشون إذ أصابهم مطر، فأووا إلى غار فانطبق عليهم، فقال بعضهم لبعض : إنه والله يا هؤلاء لا ينجيكم إلا الصدق، فليدع كل رجل منكم بما يعلم أنه قد صدق فيه، فقال واحد منهم : اللهم إن كنت تعلم أنه كان لي أجير عمل لي على فَرَقٍ من أرز، فذهب وتركه، وأني عمدت إلى ذلك الْفَرَقِ فزرعته، فصار من أمره أني اشتريت منه بقرا، وأنه أتاني يطلب أجره، فقلت : اعمد إلى تلك البقر فسقها، فقال لي : إنما لي عندك فَرَقٍ من أرز، فقلت له : اعمد إلى تلك البقر فإنها من ذلك الفرق فساقها، فإن كنت تعلم أني فعلت ذلك من خشيتك ففرج عنا، فانساحت عنهم الصخرة فقال الآخر : اللهم إن كنت تعلم أنه كان لي أبوان شيخان كبيران، فكنت آتيهما كل ليلة بلبن غنم لي فأبطأت عليهما ليلة، فجئت وقد رقدا، وأهلي وعيالي يتضاغون من الجوع، فكنت لا أسقيهم حتى يشرب أبواي، فكرهت أن أوقظهما وكرهت أن أدعهما فَيَسْتَكِنَّا لشربتهما، فلم أزل أنتظر حتى طلع الفجر، فإن كنت تعلم أني فعلت ذلك من خشيتك ففرج عنا، فانساحت عنهم الصخرة حتى نظروا إلى السماء فقال الآخر : اللهم إن كنت تعلم أنه كان لي ابنة عم من أحب الناس إلي، وأني راودتها عن نفسها فأبت إلا أن آتيها بمائة دينار، فطلبتها حتى قدرت، فأتيتها بها فدفعتها إليها فأمكنتني من نفسها، فلما قعدت بين رجليها، فقالت : اتق الله، ولا تفض الخاتم إلا بحقه، فقمت وتركت المائة دينار، فإن كنت تعلم أني فعلت ذلك من خشيتك ففرج عنا، ففرج الله عنهم فخرجوا\nمتفق عليه'),
];
