class ZakrModel {
  String title;
  String content;
  bool isFavor;
  int counter;
  List<String>? timeOfRead;
  ZakrModel({
    required this.title,
    required this.content,
    this.isFavor = false,
    this.counter = 0,
  }) : timeOfRead = [];
}
List<ZakrModel> usedListViewInsideDetails = [];
List<ZakrModel> zakrMainList = [
  ZakrModel(
      title: 'باب ما يقول إذا استيقَظ من منامه',
      content:
          'الحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشورالحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشور\nرواه البخاري'),
  ZakrModel(
    title: 'باب ما يقول إذا لبِس ثوبه',
    content:
        'اللهم إني أسألك من خيره وخير ما هو له، وأعوذ بك من شره وشرِّ ما هو له\nحسن؛ رواه أبو داود',
  ),
  ZakrModel(
    title: 'باب كيفية لبس الثوب',
    content:
        'إذا توضَّأتُم أو لبستُم، فابدَؤوا بميامنكم"؛\nصحيح؛ رواه أبو داود',
  ),
  ZakrModel(
    title: 'باب ما يقول إذا دخل الخلاء',
    content: 'اللهم إني أعوذ بك من الخُبث والخبائث\nرواه البخاري',
  ),
  ZakrModel(
    title: 'باب ما يقول إذا خرج من الخلاء',
    content: 'غفرانك\nصحيح؛ رواه الترمذي',
  ),
  ZakrModel(
    title: 'باب الذكر قبل الوضوء',
    content: 'بسم الله\nحسن؛ رواه أبو داود',
  ),
  ZakrModel(
    title: 'باب ما يقول إذا فرغ من وضوئه',
    content:
        'أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله، من قالها، فُتِحت له أبواب الجنة الثمانية، يدخل من أيِّها شاء\nرواه مسلم',
  ),
  ZakrModel(
    title: 'باب ما يقال عند الخروج من المنزل',
    content:
        'بسم الله، توكَّلت على الله، ولا حول ولا قوة إلا بالله\nصحيح؛ رواه أبو داود',
  ),
  ZakrModel(
    title: 'باب ما يقال عند الدخول إلى المنزل',
    content:
        'بسم الله وَلَجنا، وبسم الله خرجنا، وعلى الله ربنا توكَّلنا، ثم ليسلِّم على أهله\nحسن؛ رواه أبو داود',
  ),
  ZakrModel(
    title: 'باب ما يقول إذا خرج إلى الصلاة',
    content:
        'اللهم اجعل في قلبي نورًا، وفي لساني نورًا، واجعل في سمعي نورًا، واجعل في بصري نورًا، واجعل من خلفي نورًا، ومن أمامي نورًا، واجعل من فوقي نورًا، ومن تحتي نورًا، اللهم أعطني نورًا"\nرواه البخاري، ومسلم',
  ),
  ZakrModel(
    title: 'باب ما يقول عند دخول المسجد',
    content: 'اللهم افتح لي أبواب رحمتك\nرواه مسلم',
  ),
  ZakrModel(
    title: 'باب ما يقول بين السجدتين',
    content:
        'رب اغفر لي وارحمني، واجبُرني وارفعني واهدني، وعافني وارزقني\nرواه أبو داود',
  ),
  ZakrModel(
    title: 'باب ما يقول في القنوت',
    content:
        'اللهم اهدني فيمَن هديت، وعافني فيمن عافَيت، وتولَّني فيمَن تولَّيت، وبارك لي فيما أعطَيت، وقني شرَّ ما قضيت، فإنك تقضي ولا يُقضى عليك، إنه لا يَذِلُّ مَن واليت، تبارَكت ربنا وتعالَيت\nصحيح؛ رواه أبو داود',
  ),
  ZakrModel(
    title: 'باب التشهد في الصلاة',
    content:
        'التحيات لله، والصلوات، والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين، أشهد أنْ لا إله إلا الله وأشهد أن محمدًا عبده ورسوله\nرواه البخاري، ومسلم',
  ),
  ZakrModel(
    title: 'باب الدعاء إذا فرغ من التشهُّد',
    content:
        'اللهم إني أعوذ بك من عذاب جهنَّم ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شرِّ فتنة المسيح الدجَّال\nرواه مسلم',
  ),
];
